; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v7)
             (pred_12 ?v3 ?v12)
             (pred_3 ?v8 ?v12)
             (pred_9 ?v6 ?v8 )
	     (pred_6 ?v8)
             (pred_2 ?v4)
             (pred_11 ?v3)
             (pred_10 ?v12)
             (pred_8 ?v8)
             (pred_5 ?v3)
             (pred_7 ?v8)
             (pred_1 ))



(:action op_4
:parameters (?v2 ?v11 ?v10 ?v5)
:precondition (and (pred_2 ?v2) (pred_2 ?v11) (pred_11 ?v10) (pred_10 ?v5)
          (pred_4 ?v2 ?v11) (pred_12 ?v10 ?v5)
                   (pred_3 ?v11 ?v5) (pred_6 ?v2) 
                   (pred_8 ?v11) (pred_5 ?v10))
:effect (and  (pred_7 ?v11) (not (pred_8 ?v11))))


(:action op_5
:parameters (?v2 ?v13)
:precondition (and (pred_2 ?v2) (pred_2 ?v13)
               (pred_6 ?v2) (pred_4 ?v2 ?v13) (pred_7 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v2))))

(:action op_3
:parameters (?v2 ?v10)
:precondition (and (pred_2 ?v2) (pred_11 ?v10) 
                  (pred_6 ?v2) (pred_9 ?v10 ?v2) (pred_1 ))
:effect (and (pred_5 ?v10)
   (not (pred_9 ?v10 ?v2)) (not (pred_1 ))))


(:action op_2
:parameters (?v2 ?v9 ?v1)
:precondition (and (pred_2 ?v2) (pred_11 ?v9) (pred_11 ?v1)
                  (pred_6 ?v2) (pred_5 ?v1) (pred_9 ?v9 ?v2))
:effect (and (pred_5 ?v9) (pred_9 ?v1 ?v2)
        (not (pred_5 ?v1)) (not (pred_9 ?v9 ?v2))))

(:action op_1
:parameters (?v2 ?v10)
:precondition (and (pred_2 ?v2) (pred_11 ?v10) 
                  (pred_6 ?v2) (pred_5 ?v10))
:effect (and (pred_1 ) (pred_9 ?v10 ?v2) (not (pred_5 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_25 obj_11 obj_23 obj_26 obj_10 obj_29 obj_09 obj_03 obj_07 obj_27 obj_20 obj_17 obj_13 obj_12 obj_08 obj_18 obj_19 obj_15 obj_24 obj_06 obj_16 obj_01 obj_28 obj_30
    obj_02 obj_14
    obj_22 obj_21 obj_05
    )

    (:init
       (pred_1)

       (pred_2 obj_04)
       (pred_2 obj_25)
       (pred_2 obj_11)
       (pred_2 obj_23)
       (pred_2 obj_26)
       (pred_2 obj_10)
       (pred_2 obj_29)
       (pred_2 obj_09)
       (pred_2 obj_03)
       (pred_2 obj_07)
       (pred_2 obj_27)
       (pred_2 obj_20)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_15)
       (pred_2 obj_24)
       (pred_2 obj_06)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_28)
       (pred_2 obj_30)
       (pred_10 obj_02)
       (pred_10 obj_14)
       (pred_11 obj_22)
       (pred_11 obj_21)
       (pred_11 obj_05)

       (pred_4 obj_04 obj_10)
       (pred_4 obj_04 obj_25)
       (pred_4 obj_25 obj_29)
       (pred_4 obj_25 obj_11)
       (pred_4 obj_25 obj_04)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_23)
       (pred_4 obj_11 obj_25)
       (pred_4 obj_23 obj_03)
       (pred_4 obj_23 obj_26)
       (pred_4 obj_23 obj_11)
       (pred_4 obj_26 obj_07)
       (pred_4 obj_26 obj_23)
       (pred_4 obj_10 obj_27)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_29 obj_20)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_29 obj_25)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_29)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_03 obj_23)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_26)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_27 obj_08)
       (pred_4 obj_27 obj_20)
       (pred_4 obj_27 obj_10)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_20 obj_29)
       (pred_4 obj_20 obj_27)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_19)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_15)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_18)
       (pred_4 obj_15 obj_28)
       (pred_4 obj_15 obj_24)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_15 obj_19)
       (pred_4 obj_24 obj_30)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_15)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_28 obj_30)
       (pred_4 obj_28 obj_15)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_30 obj_24)
       (pred_4 obj_30 obj_28)
       (pred_8 obj_06)
       (pred_8 obj_09)
       (pred_8 obj_26)
       (pred_3  obj_06 obj_02)
       (pred_3  obj_09 obj_14)
       (pred_3  obj_26 obj_14)
       (pred_7 obj_04)
       (pred_7 obj_25)
       (pred_7 obj_11)
       (pred_7 obj_23)
       (pred_7 obj_10)
       (pred_7 obj_29)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_27)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_24)
       (pred_7 obj_16)
       (pred_7 obj_01)
       (pred_7 obj_28)
       (pred_7 obj_30)

       (pred_12  obj_22 obj_02)
       (pred_12  obj_21 obj_14)
       (pred_12  obj_05 obj_02)
       (pred_9 obj_22 obj_08)
       (pred_9 obj_21 obj_17)
       (pred_9 obj_05 obj_08)
       (pred_6 obj_17)
    )

    (:goal (and
       (pred_9 obj_22 obj_30)
       (pred_9 obj_21 obj_27)
       (pred_9 obj_05 obj_13)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_3 obj_17 obj_21)
   deleted: (pred_9 obj_21 obj_17) (pred_1)
   added: (pred_5 obj_21)
   goals met: 0 of 3
2. (op_5 obj_17 obj_20)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_20)
   goals met: 0 of 3
3. (op_5 obj_20 obj_27)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_27)
   goals met: 0 of 3
4. (op_1 obj_27 obj_21)
   deleted: (pred_5 obj_21)
   added: (pred_1) (pred_9 obj_21 obj_27)
   goals met: 1 of 3
5. (op_5 obj_27 obj_08)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_08)
   goals met: 1 of 3
6. (op_3 obj_08 obj_05)
   deleted: (pred_9 obj_05 obj_08) (pred_1)
   added: (pred_5 obj_05)
   goals met: 1 of 3
7. (op_5 obj_08 obj_27)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_27)
   goals met: 1 of 3
8. (op_5 obj_27 obj_20)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_20)
   goals met: 1 of 3
9. (op_5 obj_20 obj_17)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_17)
   goals met: 1 of 3
10. (op_5 obj_17 obj_13)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_13)
   goals met: 1 of 3
11. (op_1 obj_13 obj_05)
   deleted: (pred_5 obj_05)
   added: (pred_1) (pred_9 obj_05 obj_13)
   goals met: 2 of 3
12. (op_5 obj_13 obj_17)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_17)
   goals met: 2 of 3
13. (op_5 obj_17 obj_19)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_19)
   goals met: 2 of 3
14. (op_5 obj_19 obj_18)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_18)
   goals met: 2 of 3
15. (op_5 obj_18 obj_08)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_08)
   goals met: 2 of 3
16. (op_3 obj_08 obj_22)
   deleted: (pred_9 obj_22 obj_08) (pred_1)
   added: (pred_5 obj_22)
   goals met: 2 of 3
17. (op_5 obj_08 obj_18)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_18)
   goals met: 2 of 3
18. (op_5 obj_18 obj_19)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_19)
   goals met: 2 of 3
19. (op_5 obj_19 obj_01)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_01)
   goals met: 2 of 3
20. (op_5 obj_01 obj_28)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_28)
   goals met: 2 of 3
21. (op_5 obj_28 obj_30)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_30)
   goals met: 2 of 3
22. (op_1 obj_30 obj_22)
   deleted: (pred_5 obj_22)
   added: (pred_1) (pred_9 obj_22 obj_30)
   goals met: 3 of 3
